       IDENTIFICATION DIVISION.
       PROGRAM-ID. QUIZ-4.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT BANK-FILE
           ASSIGN TO "D:\dat\bank.dat"
           ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD BANK-FILE.
       01 BANK-REC.
           05 EMPLOYEEID PIC X(10).
           05 EMPLOYEELAST PIC X(6).
           05 EMPLOYEEFIRST PIC X(4).
           05 EMPLOYEEMIDDLE PIC X(7).
           05 POSCODEF PIC XXXXXXXXXXXX.
           05 RATEPERHRI PIC ZZZ.
           05 HRSWORKEDI PIC ZZZ.
           05 HRSABSENTI PIC ZZ.
           05 TAXF PIC ZZ,ZZZ.
           05 SSSF PIC ZZ,ZZZ.
           05 DEDUCTIONF PIC ZZZ,ZZZ.
           05 GROSSPAYF PIC ZZZ,ZZZ.
           05 NETPAYF PIC ZZZ,ZZZ.
       WORKING-STORAGE SECTION.
           01 POSCODE PIC X.
           01 RATEPERHR PIC 9(3).
           01 SSS PIC 9(5).
           01 TAX PIC 9(5).
           01 NETPAY PIC 9(6).
           01 DEDUCTION PIC 9(6).
           01 GROSSPAY PIC 9(6).
           01 HRSABSENT PIC 9(2).
           01 HRSWORKED PIC 9(3).
           01 EXCESS PIC 9(6).
           01 GETCH PIC X.
       SCREEN SECTION.
           01 CLEAR-SCREEN.
           02 BLANK SCREEN.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           OPEN EXTEND BANK-FILE.

           DISPLAY "BANKING INFOMATION CALCULATOR" AT 0101.
           DISPLAY "BY: MARK ANGELO DECENA" AT 0201.
           DISPLAY "INPUT EMPLOYEE ID: " AT 0401.
           ACCEPT EMPLOYEEID AT 0420.
           DISPLAY "INPUT EMPLOYEE LAST NAME: " AT 0501.
           ACCEPT EMPLOYEELAST AT 0527.
           DISPLAY "INPUT EMPLOYEE FIRST NAME: " AT 0601.
           ACCEPT EMPLOYEEFIRST AT 0628.
           DISPLAY "INPUT EMPLOYEE MIDDLE NAME: " AT 0701.
           ACCEPT EMPLOYEEMIDDLE AT 0729.
           DISPLAY "INPUT POSITION CODE: " AT 0801.
           ACCEPT POSCODE AT 0822.
           DISPLAY "INPUT RATE PER HOUR: " AT 0901.
           ACCEPT RATEPERHRI AT 0922.
           DISPLAY "INPUT HOURS WORKED: " AT 1001.
           ACCEPT HRSWORKEDI AT 1021.
           DISPLAY "INPUT HOURS LATE/ABSENT: " AT 1101.
           ACCEPT HRSABSENTI AT 1126.

           MOVE RATEPERHRI TO RATEPERHR.
           MOVE HRSWORKEDI TO HRSWORKED.
           MOVE HRSABSENTI TO HRSABSENT.

           COMPUTE GROSSPAY = RATEPERHR * HRSWORKED.

           IF GROSSPAY IS < 20833 THEN
               SET TAX TO 0
           ELSE IF GROSSPAY IS >= 20833 AND < 33332 THEN
               COMPUTE EXCESS = GROSSPAY - 20833
               COMPUTE TAX = EXCESS * .20
           ELSE IF GROSSPAY IS >= 33333 AND < 66666 THEN
               COMPUTE EXCESS = GROSSPAY - 33333
               COMPUTE TAX = 2500 + EXCESS * .25
           ELSE IF GROSSPAY IS >= 66667 AND < 166666 THEN
               COMPUTE EXCESS = GROSSPAY - 66667
               COMPUTE TAX = 10833.33 + EXCESS * .30
           ELSE IF GROSSPAY IS >= 166667 AND < 666666 THEN
               COMPUTE EXCESS = GROSSPAY - 166667
               COMPUTE TAX = 40833.33 + EXCESS * .32
           ELSE IF GROSSPAY IS > 666667 THEN
               COMPUTE EXCESS = GROSSPAY - 666667
               COMPUTE TAX = 200833.33 + EXCESS * .35
           END-IF.

           COMPUTE SSS = GROSSPAY * 0.045.
           COMPUTE DEDUCTION = TAX + HRSABSENT + SSS.
           COMPUTE NETPAY = GROSSPAY - DEDUCTION.

           MOVE SSS TO SSSF.
           MOVE DEDUCTION TO DEDUCTIONF.
           MOVE NETPAY TO NETPAYF.
           MOVE GROSSPAY TO GROSSPAYF.
           MOVE TAX TO TAXF.

           IF POSCODE = 'R' THEN
               MOVE 'REGULAR' TO POSCODEF
           ELSE IF POSCODE = 'T' THEN
               MOVE 'TEMPORARY' TO POSCODEF
           ELSE IF POSCODE = 'P' THEN
               MOVE 'PART-TIME' TO POSCODEF
           ELSE
               MOVE 'INVALID CODE' TO POSCODEF
           END-IF.

           DISPLAY "=======================================" AT 1301

           DISPLAY EMPLOYEELAST AT 1501 ", " AT 1507
           EMPLOYEEFIRST AT 1509 "'S BANK INFORMATION" AT 1513.
           DISPLAY "LAST NAME: " AT 1701 EMPLOYEELAST AT 1712.
           DISPLAY "FIRST NAME: " AT 1801 EMPLOYEEFIRST AT 1813.
           DISPLAY "EMPLOYEE ID: " AT 1901 EMPLOYEEID AT 1914.
           DISPLAY "POSITION CODE: " AT 2001 POSCODEF AT 2016.
           DISPLAY "GROSSPAY: P" AT 2101 GROSSPAYF AT 2112.
           DISPLAY "SSS: P" AT 2201 SSSF AT 2207.
           DISPLAY "TAX: P" AT 2301 TAXF AT 2307.
           DISPLAY "DEDUCTION: P" AT 2401 DEDUCTIONF AT 2413.
           DISPLAY "NETPAY: P" AT 2501 NETPAYF AT 2510.

           ACCEPT GETCH AT 2601.

           WRITE BANK-REC.
           CLOSE BANK-FILE.
       END PROGRAM QUIZ-4.
