       IDENTIFICATION DIVISION.
       PROGRAM-ID. 11-POSITIVE-NEGATIVE-NEUTRAL.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01 POSNEGNEU PIC S9(2).
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "INPUT NUM".
            ACCEPT POSNEGNEU.

            IF POSNEGNEU IS POSITIVE THEN
                DISPLAY POSNEGNEU " IS POSITIVE".
            IF POSNEGNEU IS NEGATIVE THEN
                DISPLAY POSNEGNEU " IS NEGATIVE".
            IF POSNEGNEU IS ZERO THEN
                DISPLAY POSNEGNEU " IS ZERO".
       END PROGRAM 11-POSITIVE-NEGATIVE-NEUTRAL.
