       IDENTIFICATION DIVISION.
       PROGRAM-ID. 13-LARGEST-AMONG-3-NUMS.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01 LARGEST1 PIC 9(2).
       01 LARGEST2 PIC 9(2).
       01 LARGEST3 PIC 9(2).
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "INPUT NUM1".
            ACCEPT LARGEST1.
            DISPLAY "INPUT NUM2".
            ACCEPT LARGEST2.
            DISPLAY "INPUT NUM3".
            ACCEPT LARGEST3.

            IF LARGEST1 > LARGEST2 AND LARGEST1 > LARGEST3 THEN
                DISPLAY LARGEST1 " IS THE BIGGEST NUMBER"
            ELSE IF LARGEST2 > LARGEST1 AND LARGEST2 > LARGEST3 THEN
                DISPLAY LARGEST2 " IS THE BIGGEST NUMBER"
            ELSE
                DISPLAY LARGEST3 " IS THE BIGGEST NUMBER".
       END PROGRAM 13-LARGEST-AMONG-3-NUMS.
