       IDENTIFICATION DIVISION.
       PROGRAM-ID. 16-FINAL-GWA.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01 PRELIMSV2 PIC 9(3).
       01 MIDTERMV2 PIC 9(3).
       01 FINALSV2 PIC 9(3).
       01 AVEV2 PIC 9(3)V9(2).
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "PRELIMS: ".
            ACCEPT PRELIMSV2.
            DISPLAY "MIDTERM: ".
            ACCEPT MIDTERMV2.
            DISPLAY "FINALS: ".
            ACCEPT FINALSV2.

            COMPUTE AVEV2 = (PRELIMSV2 + MIDTERMV2 + FINALSV2) / 3.
            IF AVEV2 >= 97 AND AVEV2 <= 100 THEN
                DISPLAY "YOUR GRADE IS 1.0 AND PASSED"
            ELSE IF AVEV2 >= 94 AND AVEV2 <= 96 THEN
                DISPLAY "YOUR GRADE IS 1.25 AND PASSED"
            ELSE IF AVEV2 >= 91 AND AVEV2 <= 93 THEN
                DISPLAY "YOUR GRADE IS 1.50 AND PASSED"
            ELSE IF AVEV2 >= 88 AND AVEV2 <= 90 THEN
                DISPLAY "YOUR GRADE IS 1.75 AND PASSED"
            ELSE IF AVEV2 >= 85 AND AVEV2 <= 87 THEN
                DISPLAY "YOUR GRADE IS 2.00 AND PASSED"
            ELSE IF AVEV2 >= 82 AND AVEV2 <= 84 THEN
                DISPLAY "YOUR GRADE IS 2.25 AND PASSED"
            ELSE IF AVEV2 >= 79 AND AVEV2 <= 81 THEN
                DISPLAY "YOUR GRADE IS 2.50 AND PASSED"
            ELSE IF AVEV2 >= 79 AND AVEV2 <= 81 THEN
                DISPLAY "YOUR GRADE IS 2.50 AND PASSED"
            ELSE IF AVEV2 >= 76 AND AVEV2 <= 78 THEN
                DISPLAY "YOUR GRADE IS 2.75 AND PASSED"
            ELSE IF AVEV2 = 75 THEN
                DISPLAY "YOUR GRADE IS 3.00 AND PASSED"
            ELSE
                DISPLAY "YOUR GRADE IS 5.00 AND FAILED".
       END PROGRAM 16-FINAL-GWA.
