       IDENTIFICATION DIVISION.
       PROGRAM-ID. 20-BANK-TRANSACTION.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01 BANKNUMBER PIC 9(10).
       01 BANKNAME PIC X(99).
       01 BANKBALANCE PIC 9(10).
       01 BANKCHOICE PIC X(1).
       01 BANKAMOUNT PIC 9(10).
       01 BANKTRANCAMOUNT PIC 9(10).
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY "BANK ACCOUNT NUMBER: ".
           ACCEPT BANKNUMBER.
           DISPLAY "BANK ACCOUNT NAME: ".
           ACCEPT BANKNAME.
           DISPLAY "BANK ACCOUNT BALANCE: ".
           ACCEPT BANKBALANCE.
           DISPLAY "[D]EPOSIT / [W]ITHDRAW".
           ACCEPT BANKCHOICE.

           IF BANKCHOICE = "D"
               PERFORM BANK-DEPOSIT
           ELSE IF BANKCHOICE = "W"
               PERFORM BANK-WITHDRAW
           ELSE
               DISPLAY "INVALID INPUT".

           BANK-DEPOSIT.
               DISPLAY "HOW MUCH TO DEPOSIT?".
               ACCEPT BANKTRANCAMOUNT.

               COMPUTE BANKBALANCE = BANKBALANCE + BANKTRANCAMOUNT.

               DISPLAY "TOTAL BALANCE AFTER DEPOSIT: P" BANKBALANCE.
               STOP RUN.

           BANK-WITHDRAW.
               DISPLAY "HOW MUCH TO WITHDRAW?".
               ACCEPT BANKTRANCAMOUNT.

               COMPUTE BANKBALANCE = BANKBALANCE - BANKTRANCAMOUNT.

               DISPLAY "TOTAL BALANCE AFTER WITHDRAW: P" BANKBALANCE.
               STOP RUN.

       END PROGRAM 20-BANK-TRANSACTION.
