       IDENTIFICATION DIVISION.
       PROGRAM-ID. 6-TOTAL-SALES-AND-DESC.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01 FIRSTNAME PIC X(4).
       01 LASTNAME PIC X(4).
       01 HOURSWORK PIC 9(2).
       01 RATEPERHOUR PIC 9(3).
       01 DEDUCTION PIC 9(5).
       01 GROSSPAY PIC 9(10).
       01 NETPAY PIC 9(10).
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY "FIRST NAME: ".
           ACCEPT FIRSTNAME.
           DISPLAY "LAST NAME: ".
           ACCEPT LASTNAME.
           DISPLAY "NUMBER OF HOURS: ".
           ACCEPT HOURSWORK.
           DISPLAY "RATE PER HOUR: ".
           ACCEPT RATEPERHOUR.
           DISPLAY "DEDUCTION: ".
           ACCEPT DEDUCTION.

           COMPUTE GROSSPAY = HOURSWORK * RATEPERHOUR.
           COMPUTE NETPAY = GROSSPAY - DEDUCTION.

           DISPLAY FIRSTNAME "'S GROSSPAY IS " GROSSPAY.
           DISPLAY FIRSTNAME "'S NETPAY IS " NETPAY.

       END PROGRAM 6-TOTAL-SALES-AND-DESC.
