       IDENTIFICATION DIVISION.
       PROGRAM-ID. 9-TENDER-CHANGE.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01 ORDERNUM PIC 9(10).
       01 ORDERAMOUNT PIC 9(4).
       01 ORDERTENDER PIC 9(4).
       01 ORDERCHANGE PIC 9(4).
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY "ORDER NUMBER:".
           ACCEPT ORDERNUM.
           DISPLAY "ORDER AMOUNT:".
           ACCEPT ORDERAMOUNT.
           DISPLAY "TENDER AMOUNT:".
           ACCEPT ORDERTENDER.

           COMPUTE ORDERCHANGE = ORDERTENDER - ORDERAMOUNT.

           DISPLAY "ORDER TOTAL   : P" ORDERAMOUNT.
           DISPLAY "TENDER AMOUNT : P" ORDERTENDER.
           DISPLAY "CHANGE        : P" ORDERCHANGE.

       END PROGRAM 9-TENDER-CHANGE.
