       IDENTIFICATION DIVISION.
       PROGRAM-ID. 24-FIBONACCI.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 FIBON1 PIC 9(2) VALUE 1.
       01 FIBON2 PIC 9(2) VALUE 1.
       01 FIBOTEMP PIC 9(2).
       01 FIBOCAP PIC 9(2).
       01 FIBOI PIC 9(2).
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY "NTH TERM"
           ACCEPT FIBOCAP.

           PERFORM UNTIL FIBOI = FIBOCAP
               DISPLAY FIBON2
               MOVE FIBON2 TO FIBOTEMP
               COMPUTE FIBON2 = FIBON1 + FIBON2
               MOVE FIBOTEMP TO FIBON1
               ADD 1 TO FIBOI
               END-PERFORM.
           STOP RUN.
       END PROGRAM 24-FIBONACCI.
