       IDENTIFICATION DIVISION.
       PROGRAM-ID. 29-TENDER-CHANGE-V2.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01 ORDERNUMV3 PIC 9(10).
       01 ORDERAMOUNTV3 PIC 9(4).
       01 ORDERTENDERV3 PIC 9(4).
       01 ORDERCHANGEV3 PIC 9(4).
       01 ORDERCOUNTV3 PIC 9(1).
       01 ITEMNAME PIC X(99).
       01 ITEMPRICE PIC 9(4).
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY "ORDER NUMBER: ".
           ACCEPT ORDERNUMV3.
           DISPLAY "ITEM COUNT: ".
           ACCEPT ORDERCOUNTV3.

           PERFORM ORDERCOUNTV3 TIMES
               DISPLAY "ITEM NAME: "
               ACCEPT ITEMNAME
               DISPLAY "ITEM PRICE: "
               ACCEPT ITEMPRICE
               COMPUTE ORDERAMOUNTV3 = ORDERAMOUNTV3 + ITEMPRICE
           END-PERFORM.

           DISPLAY "TENDER AMOUNT: ".
           ACCEPT ORDERTENDERV3.

           COMPUTE ORDERCHANGEV3 = ORDERTENDERV3 - ORDERAMOUNTV3.

           DISPLAY "TENDER AMOUNT : P" ORDERTENDERV3.
           DISPLAY "TOTAL AMOUNT   : P" ORDERAMOUNTV3.
           DISPLAY "CHANGE        : P" ORDERCHANGEV3.


       END PROGRAM 29-TENDER-CHANGE-V2.
