       IDENTIFICATION DIVISION.
       PROGRAM-ID. 22-EVEN-NUM-FROM-1-TO-N.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01 EVENBASENUM PIC 9(2).
       01 EVENNUM1 PIC 9(2).
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY "ENTER N:".
           ACCEPT EVENNUM1.
           DISPLAY " ".

           PERFORM VARYING EVENBASENUM FROM 1 BY 1 UNTIL
               EVENBASENUM > EVENNUM1
           IF FUNCTION MOD(EVENBASENUM, 2) = 0 THEN
               DISPLAY EVENBASENUM
           END-PERFORM.
       END PROGRAM 22-EVEN-NUM-FROM-1-TO-N.
