       IDENTIFICATION DIVISION.
       PROGRAM-ID. 23-FACTORIAL.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 FACTNUM PIC 9(3) VALUE 0.
       01 FACTI PIC 9(3) VALUE 0.
       01 FACTORIAL PIC 9(5) VALUE 1.
       PROCEDURE DIVISION.
               DISPLAY "ENTER NUM".
               ACCEPT FACTNUM.

               MOVE 1 TO FACTI.
               PERFORM UNTIL FACTI > FACTNUM
                   COMPUTE FACTORIAL = FACTORIAL * FACTI
                   ADD 1 TO FACTI
               END-PERFORM.

               DISPLAY "FACTORIAL IS " FACTORIAL.
       END PROGRAM 23-FACTORIAL.
