       IDENTIFICATION DIVISION.
       PROGRAM-ID. 25-PALINDROME.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 REVN PIC 9(6).
       01 REVTEMP PIC 9(6).
       01 REVREM PIC 9.
       01 REVERSEREV PIC 9(6) VALUE 000000.
       PROCEDURE DIVISION.
           DISPLAY "ENTER NUMBER: ".
           ACCEPT REVN.

           MOVE REVN TO REVTEMP.
           PERFORM REVERSER UNTIL REVN = 0.
           DISPLAY "REVERSE OF " REVTEMP " IS " REVERSEREV.
           STOP RUN.

       REVERSER.
           DIVIDE REVN BY 10 GIVING REVN REMAINDER REVREM.
           COMPUTE REVERSEREV = REVERSEREV * 10 + REVREM.
       END PROGRAM 25-PALINDROME.
