       IDENTIFICATION DIVISION.
       PROGRAM-ID. 13-LARGEST-AMONG-2-NUMS.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01 LARGER1 pic 9(2).
       01 LARGER2 pic 9(2).
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "INPUT NUM1".
            ACCEPT LARGER1.
            DISPLAY "INPUT NUM2".
            ACCEPT LARGER2.

            IF LARGER1 > LARGER2 THEN
                DISPLAY LARGER1 " IS THE BIGGEST NUMBER"
            ELSE
                DISPLAY LARGER2 " IS THE BIGGEST NUMBER".
       END PROGRAM 13-LARGEST-AMONG-2-NUMS.
