       IDENTIFICATION DIVISION.
       PROGRAM-ID. 15-PRIME-NUMBER.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 PRIMEN PIC 9(3)V99 VALUE 0.
       01 PRIMETEMP PIC 9(3) VALUE 2.
       01 PRIMEREM PIC 9(3) VALUE 0.
       01 Q PIC 9 VALUE 0.
       PROCEDURE DIVISION.
           DISPLAY "ENTER N VALUE : ".
           ACCEPT PRIMEN.

           PERFORM UNTIL PRIMETEMP >= PRIMEN
               DIVIDE PRIMEN BY PRIMETEMP GIVING Q REMAINDER PRIMEREM
               IF PRIMEREM = 0 THEN
                   DISPLAY "GIVEN NUMBER IS NOT PRIME"
               STOP RUN
               END-IF
               ADD 1 TO PRIMETEMP
           END-PERFORM.

           IF PRIMEN = PRIMETEMP THEN
               DISPLAY "NUMBER IS PRIME"
           END-IF.
           END PROGRAM 15-PRIME-NUMBER.
