       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01 COMMNAME PIC X(10).
       01 UNITSOLD PIC 9(3).
       01 UNITPRICE PIC 9(3).
       01 TOTALSALE PIC 9(10).
       01 COMMISSION PIC 9(3)V9(2).
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "SALESMAN NAME:".
            ACCEPT COMMNAME.
            DISPLAY "NUMBER OF UNIT SOLD:".
            ACCEPT UNITSOLD.
            DISPLAY "UNIT PRICE:"
            ACCEPT UNITPRICE.

            COMPUTE TOTALSALE = UNITSOLD * UNITPRICE.

            IF TOTALSALE IS <= 10000 THEN
                COMPUTE COMMISSION = TOTALSALE * 0.1
                DISPLAY "1"
            ELSE IF TOTALSALE IS >= 10001 AND TOTALSALE IS <= 15000 THEN
                COMPUTE COMMISSION = TOTALSALE * 0.15
                DISPLAY "2"
            ELSE IF TOTALSALE IS >= 15001 AND TOTALSALE IS <= 20000 THEN
                COMPUTE COMMISSION = TOTALSALE * 0.2
                DISPLAY "3"
            ELSE
                COMPUTE COMMISSION = TOTALSALE * 0.3.

            DISPLAY "COMMISSION IS: " COMMISSION.
       END PROGRAM YOUR-PROGRAM-NAME.
