       IDENTIFICATION DIVISION.
       PROGRAM-ID. 18-VOWEL-OR-CONSONANT.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01 CHARVOC PIC X(1).
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "ENTER LETTER"
            ACCEPT CHARVOC.

            IF CHARVOC = "A" OR CHARVOC = "E" OR CHARVOC = "I"
                OR CHARVOC = "O" OR CHARVOC = "U"
                DISPLAY "ENTERED LETTER IS VOWEL"
            ELSE
                DISPLAY "ENTERED LETTER IS CONSONANT".
            STOP RUN.
       END PROGRAM 18-VOWEL-OR-CONSONANT.
