       IDENTIFICATION DIVISION.
       PROGRAM-ID. 1-HELLO-WORLD.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "HELLO WORLD".
       END PROGRAM 1-HELLO-WORLD.
