       IDENTIFICATION DIVISION.
       PROGRAM-ID. 2-MDAS.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01 MDASNUM1 pic 9(2).
       01 MDASNUM2 pic 9(2).
       01 TOTAL-SUM pic 9(2).
       01 TOTAL-DIFF pic 9(2).
       01 TOTAL-PROD pic 9(2).
       01 TOTAL-QUO pic 9(2).
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "INPUT NUM1".
            ACCEPT MDASNUM1.
            DISPLAY "INPUT NUM2".
            ACCEPT MDASNUM2.

            DISPLAY "SUM OF NUM1 AND NUM2 = ".
            ADD MDASNUM1 MDASNUM2 GIVING TOTAL-SUM.
            DISPLAY TOTAL-SUM.
            DISPLAY "DIFFERENCE OF NUM1 AND NUM2 = ".
            SUBTRACT MDASNUM1 FROM MDASNUM2 GIVING TOTAL-DIFF.
            DISPLAY TOTAL-DIFF.
            DISPLAY "PRODUCT OF NUM1 AND NUM2 = ".
            MULTIPLY MDASNUM1 BY MDASNUM2 GIVING TOTAL-PROD.
            DISPLAY TOTAL-PROD.
            DISPLAY "QUOTIENT OF NUM1 AND NUM2 = ".
            DIVIDE MDASNUM1 BY MDASNUM2 GIVING TOTAL-QUO.
            DISPLAY TOTAL-QUO.

      *      DISPLAY "SUM OF MDASNUM1 AND MDASNUM2 = ".
      *      COMPUTE TOTAL-SUM = MDASNUM1 + MDASNUM2.
      *      DISPLAY TOTAL-SUM.
      *      DISPLAY "DIFFERENCE OF MDASNUM1 AND MDASNUM2 = ".
      *      COMPUTE TOTAL-DIFF = MDASNUM1 - MDASNUM2.
      *      DISPLAY TOTAL-DIFF.
      *      DISPLAY "PRODUCT OF MDASNUM1 AND MDASNUM2 = ".
      *      COMPUTE TOTAL-PROD = MDASNUM1 * MDASNUM2.
      *      DISPLAY TOTAL-PROD.
      *      DISPLAY "QUOTIENT OF MDASNUM1 AND MDASNUM2 = ".
      *      COMPUTE TOTAL-QUO = MDASNUM1 / MDASNUM2.
      *      DISPLAY TOTAL-QUO.
            STOP RUN.
       END PROGRAM 2-MDAS.
