       IDENTIFICATION DIVISION.
       PROGRAM-ID. 13-LARGEST-AMONG-2-NUMS.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT LARGEST2-FILE
           ASSIGN TO "D:\Files\dat\largest2.dat"
           ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD LARGEST2-FILE.
       01 LARGEST2-REC.
           05 LARGER1 pic 9(2).
           05 LARGER2 pic 9(2).
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           OPEN EXTEND LARGEST2-FILE.

           DISPLAY "INPUT NUM1".
           ACCEPT LARGER1.
           DISPLAY "INPUT NUM2".
           ACCEPT LARGER2.

           IF LARGER1 > LARGER2 THEN
               DISPLAY LARGER1 " IS THE BIGGEST NUMBER"
           ELSE
               DISPLAY LARGER2 " IS THE BIGGEST NUMBER".

           WRITE LARGEST2-REC.
           CLOSE LARGEST2-FILE.
           STOP RUN.
       END PROGRAM 13-LARGEST-AMONG-2-NUMS.
