       IDENTIFICATION DIVISION.
       PROGRAM-ID. 2-MDAS.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MDAS-FILE
           ASSIGN TO "D:\Files\dat\mdas.dat"
           ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD MDAS-FILE.
       01 MDAS-REC.
           05 MDASNUM1 pic 9(2).
           05 MDASNUM2 pic 9(2).
           05 TOTAL-SUM pic 9(2).
           05 TOTAL-DIFF pic 9(2).
           05 TOTAL-PROD pic 9(2).
           05 TOTAL-QUO pic 9(2).
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           OPEN EXTEND MDAS-FILE.
           DISPLAY "INPUT NUM1".
           ACCEPT MDASNUM1.
           DISPLAY "INPUT NUM2".
           ACCEPT MDASNUM2.

           DISPLAY "SUM OF NUM1 AND NUM2 = ".
           ADD MDASNUM1 MDASNUM2 GIVING TOTAL-SUM.
           DISPLAY TOTAL-SUM.
           DISPLAY "DIFFERENCE OF NUM1 AND NUM2 = ".
           SUBTRACT MDASNUM1 FROM MDASNUM2 GIVING TOTAL-DIFF.
           DISPLAY TOTAL-DIFF.
           DISPLAY "PRODUCT OF NUM1 AND NUM2 = ".
           MULTIPLY MDASNUM1 BY MDASNUM2 GIVING TOTAL-PROD.
           DISPLAY TOTAL-PROD.
           DISPLAY "QUOTIENT OF NUM1 AND NUM2 = ".
           DIVIDE MDASNUM1 BY MDASNUM2 GIVING TOTAL-QUO.
           DISPLAY TOTAL-QUO.

           WRITE MDAS-REC.
           CLOSE MDAS-FILE.
           STOP RUN.
       END PROGRAM 2-MDAS.
