       IDENTIFICATION DIVISION.
       PROGRAM-ID. 27-INVERTED-TRIANGLE-NUMBERS.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INVERTED-FILE
           ASSIGN TO "D:\Files\dat\inverted.dat"
           ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD INVERTED-FILE.
       01 INVERTED-REC.
           05 TRIROWS PIC 9(1) VALUE 6.
           05 TRILINE PIC 9(1) VALUE 1.
           05 TRICUR PIC 9(1) VALUE 5.
           05 NUMTRIANGLE PIC 9(1) VALUE 5.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           OPEN EXTEND INVERTED-FILE.

           PERFORM DISPLAY-STAR VARYING TRILINE FROM 1 BY 1 UNTIL
               TRILINE = TRIROWS.
           STOP RUN.

           WRITE INVERTED-REC.
           CLOSE INVERTED-FILE.

           DISPLAY-STAR.
               PERFORM UNTIL TRICUR < TRILINE
               DISPLAY NUMTRIANGLE WITH NO ADVANCING
               SUBTRACT 1 FROM TRICUR
               END-PERFORM.

               DISPLAY " ".
               SET TRICUR TO 5.
               SUBTRACT 1 FROM NUMTRIANGLE.
       END PROGRAM 27-INVERTED-TRIANGLE-NUMBERS.
