       IDENTIFICATION DIVISION.
       PROGRAM-ID. 13-LARGEST-AMONG-3-NUMS.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT LARGEST3-FILE
           ASSIGN TO "D:\Files\dat\largest3.dat"
           ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD LARGEST3-FILE.
       01 LARGEST3-REC.
           05 LARGEST1 PIC 9(2).
           05 LARGEST2 PIC 9(2).
           05 LARGEST3 PIC 9(2).
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           OPEN EXTEND LARGEST3-FILE.

           DISPLAY "INPUT NUM1".
           ACCEPT LARGEST1.
           DISPLAY "INPUT NUM2".
           ACCEPT LARGEST2.
           DISPLAY "INPUT NUM3".
           ACCEPT LARGEST3.

           IF LARGEST1 > LARGEST2 AND LARGEST1 > LARGEST3 THEN
               DISPLAY LARGEST1 " IS THE BIGGEST NUMBER"
           ELSE IF LARGEST2 > LARGEST1 AND LARGEST2 > LARGEST3 THEN
               DISPLAY LARGEST2 " IS THE BIGGEST NUMBER"
           ELSE
               DISPLAY LARGEST3 " IS THE BIGGEST NUMBER".

           WRITE LARGEST3-REC.
           CLOSE LARGEST3-FILE.
           STOP RUN.
       END PROGRAM 13-LARGEST-AMONG-3-NUMS.
