       IDENTIFICATION DIVISION.
       PROGRAM-ID. 11-POSITIVE-NEGATIVE-NEUTRAL.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT POSNEGNEU-FILE
           ASSIGN TO "D:\Files\dat\posnegneu.dat"
           ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD POSNEGNEU-FILE.
       01 POSNEGNEU-REC.
           05 POSNEGNEU PIC S9(2).
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           OPEN EXTEND POSNEGNEU-FILE.

           DISPLAY "INPUT NUM".
           ACCEPT POSNEGNEU.

           IF POSNEGNEU IS POSITIVE THEN
               DISPLAY POSNEGNEU " IS POSITIVE".
           IF POSNEGNEU IS NEGATIVE THEN
               DISPLAY POSNEGNEU " IS NEGATIVE".
           IF POSNEGNEU IS ZERO THEN
                DISPLAY POSNEGNEU " IS ZERO".

           WRITE POSNEGNEU-REC.
           CLOSE POSNEGNEU-FILE.
           STOP RUN.
       END PROGRAM 11-POSITIVE-NEGATIVE-NEUTRAL.
