       IDENTIFICATION DIVISION.
       PROGRAM-ID. 6-TOTAL-SALES-AND-DESC.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT TOTALSALES-FILE
           ASSIGN TO "D:\Files\dat\totalsales.dat"
           ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD TOTALSALES-FILE.
       01 TOTALSALES-REC.
           05 FIRSTNAME PIC X(4).
           05 LASTNAME PIC X(4).
           05 HOURSWORK PIC 9(2).
           05 RATEPERHOUR PIC 9(3).
           05 DEDUCTION PIC 9(5).
           05 GROSSPAY PIC 9(10).
           05 NETPAY PIC 9(10).
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           OPEN EXTEND TOTALSALES-FILE.

           DISPLAY "FIRST NAME: ".
           ACCEPT FIRSTNAME.
           DISPLAY "LAST NAME: ".
           ACCEPT LASTNAME.
           DISPLAY "NUMBER OF HOURS: ".
           ACCEPT HOURSWORK.
           DISPLAY "RATE PER HOUR: ".
           ACCEPT RATEPERHOUR.
           DISPLAY "DEDUCTION: ".
           ACCEPT DEDUCTION.

           COMPUTE GROSSPAY = HOURSWORK * RATEPERHOUR.
           COMPUTE NETPAY = GROSSPAY - DEDUCTION.

           DISPLAY FIRSTNAME "'S GROSSPAY IS " GROSSPAY.
           DISPLAY FIRSTNAME "'S NETPAY IS " NETPAY.

           WRITE TOTALSALES-REC.
           CLOSE TOTALSALES-FILE.
           STOP RUN.
       END PROGRAM 6-TOTAL-SALES-AND-DESC.
